vacuityv/esp8266-ai/firmware/src/main.cpp
  codexCustom = false;
  if (LittleFS.exists(CODEX_SPRITE_FILE)) {
    File f = LittleFS.open(CODEX_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CODEX_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        codexCustom = true;
        codexCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

  Serial.printf("[sprite] claude custom=%d frames=%d | codex custom=%d frames=%d\n", claudeCustom,
                claudeCustomFrames, codexCustom, codexCustomFrames);
}

int claudeFrameCount() { return claudeCustom ? claudeCustomFrames : CLAUDE_SPRITE_FRAMES; }
int codexFrameCount() { return codexCustom ? codexCustomFrames : CODEX_SPRITE_FRAMES; }

// Draws one sprite frame centered on screen, one row at a time so we never
// need a full-frame buffer: each row comes either from the custom LittleFS
// file (streamed) or the compiled-in PROGMEM default (copied row-by-row).
void drawSpriteFrame(bool custom, const char *file, const uint16_t *const *progmemFrames, int frameIdx, int w,
                     int h, size_t frameBytes) {
  int x0 = SCREEN_CX - w / 2, y0 = SCREEN_CY - h / 2;
  size_t rowBytes = (size_t)w * 2;
  if (custom) {
    File f = LittleFS.open(file, "r");
    if (!f) return;
    f.seek(1 + (size_t)frameIdx * frameBytes);
    for (int r = 0; r < h; r++) {
      f.read((uint8_t *)rowBuf, rowBytes);
      tft.pushImage(x0, y0 + r, w, 1, rowBuf);
    }
    f.close();
  } else {
    const uint16_t *frame = progmemFrames[frameIdx];
    for (int r = 0; r < h; r++) {
      memcpy_P(rowBuf, frame + (size_t)r * w, rowBytes);
      tft.pushImage(x0, y0 + r, w, 1, rowBuf);
    }
  }
}

// ---------- helpers ----------

String formatTokens(long tokens) {
  if (tokens >= 1000000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fM", tokens / 1000000.0);
    return String(buf);
  }
  if (tokens >= 1000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fk", tokens / 1000.0);
    return String(buf);
  }
  return String(tokens);
}

// ---------- drawing ----------

void drawStaticChrome() {
  tft.fillScreen(TFT_BLACK);
}

// Bridge unreachable / data stale -> flashing red overrides everything else,
// matches the "urgent, look now" state from the reference signal-light design.
bool bridgeStale() {
  if (!everPolled) return true;
  return (millis() - lastSuccessMs) >= 2UL * BRIDGE_POLL_INTERVAL_MS;
}

// True when the app currently on screen is waiting on a permission/approval
// prompt — drives the red "look now, act" border flash.
bool currentAppNeedsInput() {
  return currentApp == APP_CLAUDE ? claudeStatus.needsInput : codexStatus.needsInput;
}

// Paints the full square border in one color (all four sides), used for the
// attention flash so the whole edge blinks, not just the filled quota arc.
void drawFullBorder(uint16_t color) {
  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int side = SCREEN_W - 2 * RING_MARGIN;
  tft.fillRect(x0, y0, side, RING_THICKNESS, color);                              // top
  tft.fillRect(x0, SCREEN_H - RING_MARGIN - RING_THICKNESS, side, RING_THICKNESS, color); // bottom
  tft.fillRect(x0, y0, RING_THICKNESS, side, color);                              // left
  tft.fillRect(SCREEN_W - RING_MARGIN - RING_THICKNESS, y0, RING_THICKNESS, side, color); // right
}

void drawClaudeSprite(int frameIdx) {
  drawSpriteFrame(claudeCustom, CLAUDE_SPRITE_FILE, claude_sprite_frames, frameIdx, CLAUDE_SPRITE_W,
                  CLAUDE_SPRITE_H, CLAUDE_FRAME_BYTES);
}

void drawCodexSprite(int frameIdx) {
  drawSpriteFrame(codexCustom, CODEX_SPRITE_FILE, codex_sprite_frames, frameIdx, CODEX_SPRITE_W, CODEX_SPRITE_H,
                  CODEX_FRAME_BYTES);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// "3h" / "45m" / "2h10m" reset countdown; "" when unknown.
String resetLabel(int m) {
  if (m < 0) return "";
  if (m >= 60) { int mm = m % 60; return String(m / 60) + "h" + (mm > 0 ? String(mm) + "m" : ""); }
  return String(m) + "m";
}

// Linear-interpolate two RGB565 colors (t in 0..1).
uint16_t lerp565(uint16_t a, uint16_t b, float t) {
  int ar = (a >> 11) & 0x1F, ag = (a >> 5) & 0x3F, ab = a & 0x1F;
  int br = (b >> 11) & 0x1F, bg = (b >> 5) & 0x3F, bb = b & 0x1F;
  int r = ar + (int)((br - ar) * t);
  int g = ag + (int)((bg - ag) * t);
  int bl = ab + (int)((bb - ab) * t);
  return (uint16_t)((r << 11) | (g << 5) | bl);
}

// One progress bar: dark track, purple->green gradient fill of length `fillPct`,
// plus an optional time marker (light core, dark edges) at `timePct`.
void drawQuotaBar(int x, int y, int w, int h, float fillPct, float timePct, bool hasTime) {
  tft.fillRoundRect(x, y, w, h, h / 2, tft.color565(48, 48, 48));
  uint16_t pur = tft.color565(125, 92, 252), grn = tft.color565(61, 214, 140);
  int fillW = (int)(w * constrain(fillPct, 0.0f, 100.0f) / 100.0f);
  for (int i = 0; i < fillW; i++) {
    tft.drawFastVLine(x + i, y, h, lerp565(pur, grn, (float)i / w));
  }
  if (hasTime) {
    int ax = x + (int)(w * constrain(timePct, 0.0f, 100.0f) / 100.0f);
    tft.fillRect(ax - 2, y, 4, h, tft.color565(8, 8, 8)); // dark edge
    tft.fillRect(ax - 1, y, 2, h, TFT_WHITE);             // light core
  }
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Bottom quota panel: "5h 27%" + reset countdown, a 5h usage bar with a time
// marker, and a thinner weekly bar with its own marker (fill = used %, the line
// = elapsed time in that window).
void drawQuotaBars() {
  float fivePct, weekPct, fiveTime = 0, weekTime = 0;
  bool fiveHasTime = false, weekHasTime = false;
  int fiveResetMin;
  if (currentApp == APP_CLAUDE) {
    fivePct = claudeRingPct();
    weekPct = max(claudeStatus.sevenDayPct, 0.0f);
    if (claudeStatus.fiveHourResetMin >= 0) {
      fiveTime = 100.0f * (300 - claudeStatus.fiveHourResetMin) / 300.0f; fiveHasTime = true;
    } else if (claudeStatus.sessionWindowMin > 0) {
      fiveTime = 100.0f * claudeStatus.sessionMin / claudeStatus.sessionWindowMin; fiveHasTime = true;
    }
    if (claudeStatus.sevenDayResetMin >= 0) {
      weekTime = 100.0f * (10080 - claudeStatus.sevenDayResetMin) / 10080.0f; weekHasTime = true;
    }
    fiveResetMin = claudeStatus.fiveHourResetMin;
  } else {
    fivePct = max(codexStatus.primaryPct, 0.0f);
    weekPct = max(codexStatus.weeklyPct, 0.0f);
    if (codexStatus.primaryResetMin >= 0 && codexStatus.primaryWindowMin > 0) {
      fiveTime = 100.0f * (codexStatus.primaryWindowMin - codexStatus.primaryResetMin) / codexStatus.primaryWindowMin;
      fiveHasTime = true;
    }
    if (codexStatus.weeklyResetMin >= 0 && codexStatus.weeklyWindowMin > 0) {
      weekTime = 100.0f * (codexStatus.weeklyWindowMin - codexStatus.weeklyResetMin) / codexStatus.weeklyWindowMin;
      weekHasTime = true;
    }
    fiveResetMin = codexStatus.primaryResetMin;
  }
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  tft.drawString(pctText(fivePct), 20, 178, 2);
  tft.setTextColor(tft.color565(160, 160, 160), TFT_BLACK);
  tft.setTextDatum(TR_DATUM);
  tft.drawString(resetLabel(fiveResetMin), 220, 178, 2);
  drawQuotaBar(20, 196, 200, 9, fivePct, fiveTime, fiveHasTime);
  drawQuotaBar(20, 217, 200, 6, weekPct, weekTime, weekHasTime);
}

